#define _CRT_SECURE_NO_WARNINGS

#include "wincon.h"
#include <stdio.h>
#include <string.h>
#include <windows.h>

void Menu_Animation(int sec, int option);
void Menu_Animation_Authors();
void Menu_Animation_Loading();
void Menu_Animation_Table_of_records();
void Menu();

void Choiced_option(int option);

//TODO  - Главные задачи лежат в функции Choiced_option()
//TODO  - В таблице рекордов использовать структуры (как идея - в доболнительных сведениях об игроке: количество ходов, очков, времени игры...)
//TODO  - Найти применение enum, union; Списки или деревья
//TODO  - Реализовать сложность игры
//TODO  - В зависимости от любого параметра менять авторскую анимацию на другую
//TODO  - во вкладке справка реализовать возможность отключения анимаций загрузки и т.п.

int main() {
    Menu();  //  Запуск меню и программы
    return 0;
}
//  ================================================  Анимации  ========================================================
void Menu_Animation(int sec, int option) {  //  Анимация появления меню (sec - время анимации: 200 - default, 0 - без анимации); Номер подсвечиваемой опции (0 - default)
    ///  - Функция вывода меню  (!!!Сильно зависит от изначальной картинки. В случае заменый меню ломается логика!!!)

    con_set_color(CON_CLR_WHITE_LIGHT, CON_CLR_BLACK);  //  Меняем на черный фон и белыми буквами
    show_cursor(0);  //  Скрытие курсора
    clrscr();  //  Очистка окна и окрас консоли в цвет

    //  Листинг таблицы-меню
    char menu_table[25][50] = { "========[   Игра \"Балда\"   ]========",
                                "/::\\                            /::\\",
                                "[[]]========[   Меню   ]========[[]]",
                                "\\::/                            \\::/",
                                " ||     [<]   "," Играть ","   [>]     || ",
                                " ||                              || ",
                                " ||     [*]   "," Рекорды ","  [*]     || ",
                                " TT                              TT ",
                                " ||     [I] "," О программе ","[I]     || ",
                                " ||                              || ",
                                " ||     [?]  "," Справка ","   [?]     || ",
                                " ||                              || ",
                                "/__\\    [x]   "," Выход ","    [x]    /__\\",
                                "|::|                            |::|",
                                "IIII============================IIII" };

    int width_of_table = 36;  //  Ширина меню
    int height_of_table = 15;  //  Высота меню

    int mark_X = 0;  //  Марка для вывода знаков '='

    short width_of_console;  //  Ширина консоли
    short height_of_console;  //  Высота консоли

    for (int step_of_output = 0; step_of_output < (con_width_new() - width_of_table)/2; step_of_output += 3) {  //  Цикл анимации вывода '='

        width_of_console = con_width_new();
        height_of_console = con_height_new();

        gotoxy((short) mark_X, (height_of_console - height_of_table) / 2);  //  Вверх + лево
        printf("===");

        gotoxy(width_of_console - mark_X - 3, (height_of_console - height_of_table) / 2);  //  Вверх + право
        printf("===");

        gotoxy(width_of_console - mark_X - 3, (height_of_console - height_of_table) / 2 + height_of_table - 1);  //  Низ + право
        printf("===");

        gotoxy((short) mark_X, (height_of_console - height_of_table) / 2 + height_of_table - 1);  //  Низ + лево
        printf("===");

        mark_X += 3;  //  Двигаем марку x для вывода следующих символов

        Sleep(sec);  //  Усыплени компилятора
    }

    int string_of_console = 0;  //  Строка, которуб сейчас использует вывод меню
    for (int string_of_menu = 0; string_of_menu < height_of_table + 10; string_of_menu++) {  //  Вывод меню
        //  ====================  Опасный участок (очень сильно зависит от нарисованной картинки)  ========================================
        //  Учет элементов меню для не перехода курсора
        if (string_of_menu != 5 && string_of_menu != 6) {  //  Не переход 1 опции
            if (string_of_menu != 9 && string_of_menu != 10) { //  //  Не переход 2 опции
                if (string_of_menu != 13 && string_of_menu != 14) {  //  Не переход 3 опции
                    if (string_of_menu != 17 && string_of_menu != 18) {  //  Не переход 4 опции
                        if (string_of_menu != 21 && string_of_menu != 22) {  //  Не переход 5 опции
                            gotoxy((width_of_console - width_of_table) / 2, (height_of_console - height_of_table) / 2 + string_of_console++);
                        }
                    }
                }
            }
        }
        //  ===============================================================================================================================
        if (string_of_menu == 5 + 4*option) {  //  Условие для окраски определенной опции в меню

            con_set_color(CON_CLR_BLACK,CON_CLR_WHITE_LIGHT);  //  Меняем на белый фон с черными буквами
            printf("%s", &menu_table[string_of_menu][0]);
            con_set_color(CON_CLR_WHITE_LIGHT, CON_CLR_BLACK);  //  Меняем на черный фон и белыми буквами

        } else {
            printf("%s", &menu_table[string_of_menu][0]);
        }

    }

}

void Menu_Animation_Authors() {  //  Анимация запуска программы
    ///  - Создано 2-е анимации перехода буквы в букву (из 'R' в 'D' и наоборот)
    ///  - Как основа - выбрана первая анимация (picture_1). Вторая анимация не используется, однако присутствует
    ///  - Функция лишь для вывода анимации букв авторов в консоли перед работой меню

    con_set_color(CON_CLR_BLACK, CON_CLR_GRAY);  //  Устанавливаем серый фон и черный шрифт
    show_cursor(0);  //  Скрытие курсора

    //  Трехмерный массив первой картинки, ее вариации ( picture_1[кол. вариаций в анимации][строчек символа][символов в строчке] )
    const char picture_1[5][21][26] = { {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/__\\:::\\    \\    ","   /::::\\   \\:::\\    \\   ","  /::::::\\   \\:::\\    \\  ",
                                   " /:::/\\:::\\   \\:::\\____\\ ","/:::/  \\:::\\   \\:::|    |","\\::/   |::::\\  /:::|____|",
                                   " \\/____|:::::\\/:::/    / ","       |:::::::::/    /  ","       |::|\\::::/    /   ",
                                   "       |::| \\::/____/    ",
                                   "       |::|  ~|          ","       |::|   |          ","       \\::|   |          ",
                                   "        \\:|   |          ","         \\|___|          "},
          /* 2 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/__\\:::\\    \\    ","   /::::\\   \\:::\\    \\   ","  /::::::\\   \\:::\\    \\  ",
                                   " /:::/\\:::\\   \\:::\\____\\ "," /:::/    /   \\:::\\ ___\\ ","\\::/   |::::\\  /:::|____|",
                                   " \\/____|:::::\\/:::/    / ","       |:::::::::/    /  ","       |::|\\::::/    /   ",
                                   "       |::| \\::/____/    ","       |::|  ~|          ","       |::|   |          ",
                                   "       \\::|   |          ","        \\:|   |          ","         \\|___|          "},
          /* 3 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/__\\:::\\    \\    ","   /::::\\   \\:::\\    \\   ","   /:::/    \\:::\\    \\   ",
                                   "  /:::/    / \\:::\\    \\  "," /:::/    /   \\:::\\ ___\\ ","/:::/____/  ___\\:::|    |",
                                   "\\:::\\    \\ /\\  /:::|____|","       |:::::::::/    /  ","       |::|\\::::/    /   ",
                                   "       |::| \\::/____/    ","       |::|  ~|          ","       |::|   |          ",
                                   "       \\::|   |          ","        \\:|   |          ","         \\|___|          "},
          /* 4 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "     /:::/\\:::\\    \\     ","    /:::/  \\:::\\    \\    ","   /:::/    \\:::\\    \\   ",
                                   "  /:::/    / \\:::\\    \\  "," /:::/    /   \\:::\\ ___\\ ","/:::/____/  ___\\:::|    |",
                                   "\\:::\\    \\ /\\  /:::|____|"," \\:::\\    /::\\ \\::/    / ","  \\:::\\   \\:::\\ \\/____/  ",
                                   "       |::| \\::/____/    ",
                                   "       |::|  ~|          ","       |::|   |          ","       \\::|   |          ",
                                   "        \\:|   |          ","         \\|___|          "},
          /* 5 вариация */         {"                         ","          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/  \\:::\\    \\    ","   /:::/    \\:::\\    \\   ","  /:::/    / \\:::\\    \\  ",
                                   " /:::/    /   \\:::\\ ___\\ ","/:::/____/  ___\\:::|    |","\\:::\\    \\ /\\  /:::|____|",
                                   " \\:::\\    /::\\ \\::/    / ","  \\:::\\   \\:::\\ \\/____/  ","   \\:::\\   \\:::\\____\\    ",
                                   "    \\:::\\  /:::/    /    ","     \\:::\\/:::/    /     ","      \\::::::/    /      ",
                                   "       \\::::/    /       ","        \\::/____/        "} };

    //  Трехмерный массив второй картинки, ее вариации
    const char picture_2[5][21][26] = { {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/  \\:::\\    \\    ","   /:::/    \\:::\\    \\   ","  /:::/    / \\:::\\    \\  ",
                                   " /:::/    /   \\:::\\ ___\\ ","/:::/____/  ___\\:::|    |","\\:::\\    \\ /\\  /:::|____|",
                                   " \\:::\\    /::\\ \\::/    / ","  \\:::\\   \\:::\\ \\/____/  ","   \\:::\\   \\:::\\____\\    ",
                                   "    \\:::\\  /:::/    /    ","     \\:::\\/:::/    /     ","      \\::::::/    /      ",
                                   "       \\::::/    /       ","        \\::/____/        ","                         "},
          /* 2 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/  \\:::\\    \\    ","   /:::/    \\:::\\    \\   ","  /:::/    / \\:::\\    \\  ",
                                   "/:::/  \\:::\\   \\:::|    |","/:::/____/  ___\\:::|    |","\\:::\\    \\ /\\  /:::|____|",
                                   " \\:::\\    /::\\ \\::/    / ","  \\:::\\   \\:::\\ \\/____/  ","   \\:::\\   \\:::\\____\\    ",
                                   "    \\:::\\  /:::/    /    ","     \\:::\\/:::/    /     ","      \\::::::/    /      ",
                                   "       \\::::/    /       ","        \\::/____/        ","                         "},
          /* 3 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/  \\:::\\    \\    ","  /::::::\\   \\:::\\    \\  "," /:::/\\:::\\   \\:::\\____\\ ",
                                   "/:::/  \\:::\\   \\:::|    |","\\::/   |::::\\  /:::|____|"," \\/____|:::::\\/:::/    / ",
                                   " \\:::\\    /::\\ \\::/    / ","  \\:::\\   \\:::\\ \\/____/  ","   \\:::\\   \\:::\\____\\    ",
                                   "    \\:::\\  /:::/    /    ","     \\:::\\/:::/    /     ","      \\::::::/    /      ",
                                   "       \\::::/    /       ","        \\::/____/        ","                         "},
          /* 4 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","     /:::/\\:::\\    \\     ","    /:::/__\\:::\\    \\    ",
                                   "   /::::\\   \\:::\\    \\   ","  /::::::\\   \\:::\\    \\  "," /:::/\\:::\\   \\:::\\____\\ ",
                                   "/:::/  \\:::\\   \\:::|    |","\\::/   |::::\\  /:::|____|"," \\/____|:::::\\/:::/    / ",
                                   "       |:::::::::/    /  ","       |::|\\::::/    /   ","       |::| \\::/____/    ",
                                   "   \\:::\\  /:::/    /     ","    \\:::\\/:::/    /      ","     \\::::::/    /       ",
                                   "      \\::::/    /        ","       \\::/____/         ","                         "},
          /* 5 вариация */        {"          _____          ","         /\\    \\         ","        /::\\    \\        ",
                                   "       /::::\\    \\       ","      /::::::\\    \\      ","     /:::/\\:::\\    \\     ",
                                   "    /:::/__\\:::\\    \\    ","   /::::\\   \\:::\\    \\   ","  /::::::\\   \\:::\\    \\  ",
                                   " /:::/\\:::\\   \\:::\\____\\ ","/:::/  \\:::\\   \\:::|    |","\\::/   |::::\\  /:::|____|",
                                   " \\/____|:::::\\/:::/    / ","       |:::::::::/    /  ","       |::|\\::::/    /   ",
                                   "       |::| \\::/____/    ","       |::|  ~|          ","       |::|   |          ",
                                   "       \\::|   |          ","        \\:|   |          ","         \\|___|          "} };

    const int width_of_picture = 25;  //  Ширина картинок
    const int height_of_picture = 21;  //  Высота картинок

    Sleep(1000);

    for (int current_picture = 0; current_picture < 5; current_picture++) {  //  Цикл вывода картинок (5 различных версия картинки)

        Sleep(500);

        clrscr();  //  Очистка окна и окрас консоли в цвет

        int width_of_console = con_width_new();  //  Ширина консоли
        int height_of_console = con_height_new();  //  Высота консоли

        short current_X = (width_of_console - width_of_picture) / 2;
        short current_Y = (height_of_console - height_of_picture) / 2;

        gotoxy(current_X, current_Y);  //  Перемещаем курсор на начальную позицию вывода

        for (int string_picture = 0; string_picture < height_of_picture; string_picture++) {  //  Цикл вывода строк для картинок

            printf("%s", &picture_1[current_picture][string_picture][0]);  //  Вывод первой картинки

            gotoxy(current_X,++current_Y);  //  Перемещение курсора на следующую строку (стразу на изначальную позицию вывода)
        }

    }

    Sleep(1000);
    clrscr();  //  Очистка окна и окрас консоли в цвет
}

void Menu_Animation_Loading() {  //  Анимация загрузки программы
    ///  Функция лишь для вывода анимации загрузки во время работы программы
    ///     (Не отображает степень загрузки системы)

    con_set_color(CON_CLR_WHITE_LIGHT, CON_CLR_BLACK);  //  Меняем на черный фон и серыми буквами
    show_cursor(0);  //  Скрытие курсора
    clrscr();  //  Очистка окна и окрас консоли в цвет

    const char animation_loading[] = { "/-\\|" };  //  Анимация

    gotoxy(con_width_new() - 20,con_height_new() - 4);
    printf("Loading...");

    for (int step = 0; step < 2; step++) {

        short required_width_of_console = con_width_new() - 20;  //  Ширина консоли
        short required_height_of_console = con_height_new() - 4;  //  Высота консоли

        gotoxy(required_width_of_console, required_height_of_console);

        for (int step_of_animation = 0; step_of_animation < 4; step_of_animation++) {

            gotoxy(required_width_of_console + strlen("Loading..."), required_height_of_console);
            printf("%c", animation_loading[step_of_animation]);
            Sleep(250);

        }

    }

    clrscr();  //  Очистка окна и окрас консоли в цвет
    Sleep(1000);
}

void Menu_Animation_Table_of_records() {  //  Анимация загрузки таблицы рекордов
    ///  - Функция лишь анимация загрузки таблицы рекордов (не отображает загруженность системы)

    con_set_color(CON_CLR_WHITE_LIGHT, CON_CLR_BLACK);  //  Меняем на черный фон и серыми буквами
    show_cursor(0);  //  Скрытие курсора
    clrscr();  //  Очистка окна и окрас консоли в цвет

    //  Фигурки человечков
    char figures[3][46] = { "   ( ._.)                               LLL", "  (___)                                 (  (>",
                                "  /  |                                  /  \\" };
    //  Позиции загрузки
    char positions[5][45] = { "  ( 9 )9  [====                    ]  \\(*_*)","  ( 9 )9  [=========               ]  \\(*_*)",
                              "  ( 9 )9  [===============         ]  \\(*_*)","  ( 9 )9  [====================    ]  \\(*_*)",
                              "  ( 9 )9  [========================]  \\(*_*)"};

    const int width_of_picture = 44;  //  Ширина картинок
    const int height_of_picture = 4;  //  Высота картинок

    for (int step = 0; step < 5; step++) {  //  Цикл расположения прогресс-бара

        int width_of_console = con_width_new();  //  Ширина консоли
        int height_of_console = con_height_new();  //  Высота консоли

        gotoxy((width_of_console-width_of_picture)/2, (height_of_console-height_of_picture)/2 - 1);
        printf("%s", &figures[0][0]);  //  Первая фиксированная строка

        gotoxy((width_of_console-width_of_picture)/2, (height_of_console-height_of_picture)/2);  //  Центр консоли
        printf("%s", &positions[step][0]);  //  Прогресс-бар

        gotoxy((width_of_console-width_of_picture)/2, (height_of_console-height_of_picture)/2 + 1);
        printf("%s", &figures[1][0]);  //  Вторая фиксированная строка

        gotoxy((width_of_console-width_of_picture)/2, (height_of_console-height_of_picture)/2 + 2);
        printf("%s", &figures[2][0]);  //  Третья фиксированная строка

        if (step == 0) {  //  Условие выделения времени загрузки на загрузку
            Sleep(400);
        } else if (step == 1) {
            Sleep(450);
        } else if (step == 2) {
            Sleep(900);
        } else if (step == 3) {
            Sleep(200);
        } else if (step == 4) {
            Sleep(250);
        }

    }

    Sleep(150);
    clrscr();  //  Очистка окна и окрас консоли в цвет
}
//  ===============================================  Меню игры  ========================================================
void Menu() {  //  Главное меню игры
    ///  Функция главного меню игры, с которого идет выбор анимаций и опций

    // Инициализируется консоль
    con_init(80, 25);

    Menu_Animation_Authors();  //  Запуск анимация авторов
    Menu_Animation_Loading();  //  Запуск анимации загрузки

    Menu_Animation(200, 0);  //  Запуск анимации появления меню
    //  >>  Меню запущено

    int code = 0;  //  Нажатый символ с клавиатуры
    int current_option = 0;  //  Текущая выделяемая опция
    while(1) {
        Menu_Animation(0, current_option);

        while (!key_is_pressed()) {
            code = key_pressed_code();  //  Считываем код символа

            if (code == KEY_UP) {  //  Если стрелка вверх
                if (current_option == 0) {  //  Если уже потолок опций
                    continue;
                } else {
                    current_option--;
                    break;
                }
            }
            if (code == KEY_DOWN) {  //  Если стрелка вниз
                if (current_option == 4) {
                    continue;
                } else {
                    current_option++;
                    break;
                }
            }

            if (code == KEY_ENTER && current_option == 4) {  //  Выбран выход и программы
                //TODO  Анимация закрытия программы

                ExitProcess(EXIT_SUCCESS);
            }
            if (code == KEY_ENTER) {  //  Введен ввод
                Choiced_option(current_option);
            }

            //pause(40); // Небольная пауза (чтобы не загружать процессор)
        }

    }

}
//  =========================================  Обслуживающие функции  ==================================================
void Choiced_option(int option) {  //  Выбранная опция
    ///  Обслуживающая функция главного меню, однако используется и для вывода экрана с ошибкой работы
    ///     (В передаваемых зпараметрах - 5 (или больше) для вызова экрана ошибки)

    if (option == 0) {  //  Опция 'Играть'
        //TODO  Реализовать опцию игры
    } else if (option == 1) {  //  Опция 'Рекорды'
        //TODO  Реализовать опцию таблицы рекордов
    } else if (option == 2) {  //  Опция 'О программе'
        //TODO  Реализовать опцию 'о программе'
    } else if (option == 3) {  //  Опция 'Справка'
        //TODO  Реализовать справку
    } else {  //  Неверное число (либо ошибка работы программы)
        con_set_color(CON_CLR_BLACK, CON_CLR_RED);  //  Меняем на красный фон и черными буквами
        show_cursor(0);  //  Скрытие курсора
        clrscr();  //  Очистка окна и окрас консоли в цвет

        char Error[] = { "!!! ERROR !!!" };

        gotoxy((con_width_new() - strlen(Error)) / 2, con_height_new() / 2);
        printf("%s", Error);
        Sleep(500);

        getchar();
        ExitProcess(EXIT_FAILURE);
    }
}